<strong> DataFrames is gonna be our main tool when working with Pandas!

In [28]:
import numpy as np
import pandas as pd

In [30]:
from numpy.random import randn
np.random.seed(101)

In [31]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

<strong> Each of the columns above is a Panda Serie.

<strong> Thus, a DataFrame is just a bunch of Series!

In [37]:
df['W'] # the main way to grab a serie of a dataframe is using a bracket notation and writing the column name.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
type(df['W'])

pandas.core.series.Series

In [39]:
# you can also use this:
df.W
# but, is NOT recommended! (one of the dataframe methods can be overwritten by a column name)

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [40]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [41]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

In [42]:
df['newColumn'] = df['W'] + df['Y']

In [43]:
df['newColumn']

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
Name: newColumn, dtype: float64

In [44]:
df.drop('newColumn', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df

          W         X         Y         Z  newColumn
A  2.706850  0.628133  0.907969  0.503826   3.614819
B  0.651118 -0.319318 -0.848077  0.605965  -0.196959
C -2.018168  0.740122  0.528813 -0.589001  -1.489355
D  0.188695 -0.758872 -0.933237  0.955057  -0.744542
E  0.190794  1.978757  2.605967  0.683509   2.796762

In [46]:
df.drop('newColumn', axis=1,inplace=True)

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

<strong> You can also use 'df.drop()' to drop rows:

In [48]:
df.drop('E') # axis = 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [53]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [52]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [54]:
df.loc['B','Y']

-0.8480769834036315

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.loc[['A','B'],['W','Y']]